INSERT INTO public.products (product_name, price)
VALUES ('Испорченный телефон', 1111.11),
       ('Сарафанное радио', 2222.22),
       ('Патефон', 3333.33);

INSERT INTO public.shops (shop_name)
VALUES ('DNS'), ('MVIDEO'), ('SITILINK');

INSERT INTO public.plan (shop_id, product_id, plan_cnt, plan_date)
VALUES (1, 1, 11, '2023-06-30'), (1, 2, 22, '2023-06-30'),
       (1, 3, 33, '2023-06-30'), (2, 1, 11, '2023-06-30'),
       (2, 2, 22, '2023-06-30'), (2, 3, 33, '2023-06-30'),
       (3, 1, 11, '2023-06-30'), (3, 2, 22, '2023-06-30'),
       (3, 3, 33, '2023-06-30');

INSERT INTO public.shop_dns (product_id, sales_cnt, sales_date)
VALUES (1, 5, '2023-06-01'), (1, 10, '2023-06-11'), (1, 6, '2023-06-12'),
       (2, 3, '2023-06-02'), (2, 8, '2023-06-12'), (2, 10, '2023-06-13'),
       (3, 4, '2023-06-03'), (3, 5, '2023-06-13'), (3, 21, '2023-06-14');

INSERT INTO public.shop_mvideo (product_id, sales_cnt, sales_date)
VALUES (1, 4, '2023-06-01'), (1, 3, '2023-06-11'), (1, 1, '2023-06-12'),
       (2, 6, '2023-06-02'), (2, 7, '2023-06-12'), (2, 2, '2023-06-13'),
       (3, 5, '2023-06-03'), (3, 5, '2023-06-13'), (3, 8, '2023-06-14');

INSERT INTO public.shop_sitilink (product_id, sales_cnt, sales_date)
VALUES (1, 10, '2023-06-01'), (1, 9, '2023-06-11'), (1, 3, '2023-06-12'),
       (2, 3, '2023-06-02'), (2, 4, '2023-06-12'), (2, 4, '2023-06-13'),
       (3, 7, '2023-06-03'), (3, 2, '2023-06-13'), (3, 6, '2023-06-14');
